src/cf/Catalogs/Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Процессы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭлементыПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Персона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеДействие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаяФункциональность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Функциональности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяИстория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользовательскиеИстории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесЦель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесЦели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ЭлементыПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ЭлементыПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскаяИстория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВариантУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Процессы/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если Поля.Найти("ЭлементПроцесса") = Неопределено Тогда
		Поля.Добавить("ЭлементПроцесса");
	КонецЕсли;
	Если Поля.Найти("Персона") = Неопределено Тогда
		Поля.Добавить("Персона");
	КонецЕсли;
	Если Поля.Найти("КлючевоеДействие") = Неопределено Тогда
		Поля.Добавить("КлючевоеДействие");
	КонецЕсли;
	Если Поля.Найти("Описание") = Неопределено Тогда
		Поля.Добавить("Описание");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ПользовательскаяИстория Тогда
		Представление = "" + Данные.Персона + " будет " + Данные.КлючевоеДействие;
		
	ИначеЕсли Данные.ЭлементПроцесса = Перечисления.ЭлементыПроцесса.Условие Тогда
		Представление = "" + Данные.Персона + " " + Данные.Описание;
		
	Иначе
		Представление = Данные.Описание;
		
	КонецЕсли;
КонецПроцедуры
